# RailingSystemSecondaryHandrailsHeightParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemSecondaryHandrailsHeightParam Property
ParameterTypeId Class See Also
---
"Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSecondaryHandrailsHeightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSecondaryHandrailsHeightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSecondaryHandrailsHeightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace